Repository: butterbrodskij/linux_development_2025
Catalog: 11_Documenting/po/*.po
Languages: ru

source: Usage: %s [OPTION]
ru: Использование: %s [ПАРАМЕТР]

source: Guess the number game using binary search algorithm.
ru: Игра 'Угадай число' с использованием алгоритма бинарного поиска.

source: Options:
ru: Параметры:

source: -h, --help display this help and exit
ru: -h, --help показать эту справку и выйти

source: -r, --roman use Roman numerals instead of Arabic
ru: -r, --roman использовать римские цифры вместо арабских

source: Description:
ru: Описание

source: The program will try to guess your number between %d and %d
ru: Программа будет пытаться угадать ваше число от %d до %d,

source: by asking questions. Answer with 'yes'/'no' or 'y'/'n' (also supports Russian).
ru: задавая вопросы. Отвечайте 'да'/'нет' или 'д'/'н' (также поддерживается английский язык).

source: Error: Unknown option '%s'
ru: Ошибка: Неизвестный параметр '%s'

source: Try '%s --help' for more information.
ru: Попробуйте '%s --help' для более детальной информации.

source: guess a number from %s to %s
ru: загадайте число от %s до %s

source: is your number greater than %s? (Yes/No) >
ru: ваше число больше %s? (Да/Нет) >

source: unexpected EOF
ru: некорректный конец ввода

source: unexpected answer: "%s"
ru: некорректный ответ: "%s"

source: your number: %s
ru: ваше число: %s
